In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\fury coder\python and ml\venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\fury coder\python and ml\venv\lib\site-packages (from pandas) (2.1.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\fury coder\python and ml\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\fury coder\python and ml\venv\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\fury coder\python and ml\venv\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\fury coder\python and ml\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [ ]:
## series (1D array)
import pandas as pd
data = [1,2,3,4,5]
s = pd.Series(data)
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
## CREATE A SERIES FROM DICTIONARY
data ={ 'a':0., 'b':1., 'c':2.}
s = pd.Series(data)
print(s)

a    0.0
b    1.0
c    2.0
dtype: float64

In [5]:
data = [10,20,30,40,50]
index = ['a','b','c','d','e']
s = pd.Series(data,index)
print(s)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
# DatdaFrame (2D array)

data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print(df)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [7]:
df.loc[1]

Name    Bob
Age      12
Name: 1, dtype: object

In [8]:
df.iloc[1]

Name    Bob
Age      12
Name: 1, dtype: object

In [9]:
df.iloc[0][0]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_21220\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Alex'

In [10]:
## Accessing a specified element
df['Name'][1]

'Bob'

In [12]:
df.at[1,'Age']

np.int64(12)

In [13]:
## Accessing a specified element using iat function
df.iat[1,1]

np.int64(12)

In [14]:
## Data MAnipulation with dataframes

df['salary'] = [100,200,300]

In [15]:
df

     Name  Age  salary
0    Alex   10     100
1     Bob   12     200
2  Clarke   13     300

In [18]:
## remove a column
df.drop('salary',axis=1, inplace=True)

In [19]:
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [20]:
df['Age'] = df['Age']+1
df

     Name  Age
0    Alex   11
1     Bob   13
2  Clarke   14

In [21]:
df.drop(0)

     Name  Age
1     Bob   13
2  Clarke   14

In [22]:
df

     Name  Age
0    Alex   11
1     Bob   13
2  Clarke   14

In [25]:
df

     Name  Age
1     Bob   13
2  Clarke   14